resume.tex
% Created 2024-01-14 Sun 18:52
% Intended LaTeX compiler: xelatex
\documentclass[a4paper, fleqn, oneside]{article}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\NeedsTeXFormat{LaTeX2e}
\usepackage{fontspec}
\usepackage[usenames,dvipsnames]{color}
\usepackage{fontawesome5}
\usepackage[margin=0.4in]{geometry}
\usepackage[hidelinks]{hyperref}
\usepackage[noabbrev]{cleveref}
\usepackage{tabularx}
\usepackage{titlesec}
\hypersetup{colorlinks=true, urlcolor=NavyBlue}
\setlength{\parindent}{0pt}
\definecolor{DarkGray}{RGB}{90, 80, 70}
\definecolor{LightGray}{RGB}{150, 140, 130}
\pagestyle{empty}
\titleformat{\section}{\vspace{-1em}\color{DarkGray}\bfseries\sffamily\raggedright\Large}{}{0em}{}[\titlerule \vspace*{0.5em}]
\usepackage[inline]{enumitem}
\setlist{itemsep=-2pt}
\usepackage[stretch=10]{microtype}
\usepackage{hyphenat}
\renewcommand{\baselinestretch}{1.15}
\author{s.t}
\date{\today}
\title{}
\hypersetup{
 pdfauthor={s.t},
 pdftitle={},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 29.1 (Org mode 9.7)}, 
 pdflang={English}}
\begin{document}

\begin{center}
\color{DarkGray}{\textbf{\huge TAKOOR}} {\textbf{\large Shashiduth}}} \\[1mm] {\textbf{\large{I}}NFORMATION \textbf{\large{S}}ECURITY \textbf{\large{A}}NALYST \\[1mm] {\small \faPhone\ (+230) 5928-0406 \quad | \quad \faEnvelope\ \href{mailto:shashiduth.takoor@gmail.com}{shashiduth.takoor@gmail.com} \quad | \quad \faGithub\ \href{https://github.com/s-takoor}{github.com/s-takoor} \quad | \quad \faLinkedin\ \href{https://linkedin.com/in/shashiduth-takoor-540286226}{linkedin.com/in/shashiduth-takoor}}
\end{center} \\[2mm]
\section{SUMMARY}
\label{sec:org00b1e3f}
Information Security (InfoSec) Analyst with 6+ years of hands-on experience in cybersecurity, specialising in both defensive and offensive security. Proven track record as a cybersecurity consultant, delivering expertise across diverse locations such as Mauritius, Madagascar, Djibouti, and the Kingdom of Saudi Arabia.

\vspace{2em}
\section{WORK EXPERIENCE}
\label{sec:org2935aaa}
{\color{DarkGray}{\bfseries{\large Checkout Ltd.}} \hfill \textit{Ebene, Mauritius}} \\
{\color{LightGray}{\bfseries{INFORMATION SECURITY ANALYST}} \hfill {\textit{Mar. 2022 - Present}}}
\begin{itemize}
\item Leveraging Wiz's Cloud Security Posture Management (CSPM) solution to uncover vulnerabilities, misconfigurations and unnecessary permissions across cloud resources and automate incident response.
\item Integrated Wiz into development workflows to detect vulnerabilities, secrets, and misconfigurations in IaC templates, containers and VM images.
\item Vulnerability management and PCI ASV leveraging on Qualys, configuring option profiles and performing vulnerability scans.
\item Maintain compliance against industry standard regulations and benchmarks such as Payement Card Industry Data Security Standard (PCI DSS).
\item Monitoring and analysing security events leveraging on LogRhythm SIEM and Microsoft Azure Sentinel SIEM and SOAR.
\item Assisted in deploying endpoint protection solution such as Cylance and SentinelOne organisation-wide.
\item Manage cloud applications traffic via Netskope CASB solution and integration with Garrison Ultra Remote Browser Isolation (RBI).
\item Conduct security assessments, identify vulnerabilities, and recommend remediation strategies. Activities include but not limited to API testing, mobile SDK testing, and segmentation testing.
\item Assisted with the review of findings from HackerOne who is responsible for performing bug bounty and vulnerability detection program for in-scope items.
\item Collaborated with cross-functional teams to ensure compliance with industry standards and regulations.
\end{itemize}

\vspace{2em}
{\color{DarkGray}{\bfseries{\large Mauritius Network Services (MNS) Ltd.}} \hfill \textit{Ebene, Mauritius}} \\
{\color{LightGray}{\bfseries{INFORMATION SECURITY OFFICER}} \hfill {\textit{Sep. 2020 - Feb. 2022}}}
\begin{itemize}
\item Implemented Wazuh, an open source security platform, to enhance security monitoring capabilities. Proficiently monitored and analysed security events, ensuring proactive threat detection and response.
\item Incident handling and incident response, swiftly mitigating security incidents to minimise potential risks.
\item Reviewed and enhanced existing information security policies and procedures to align with industry best practices such as ISO 27001.
\item Conducted security assessments, identifying vulnerabilities and offering strategic remediation strategies for stakeholders’ optimal security posture.
\end{itemize}

\vspace{2em}
{\color{DarkGray}{\bfseries{\large Ernst & Young (EY)}} \hfill \textit{Ebene, Mauritius}} \\
{\color{LightGray}{\bfseries{INFORMATION SECURITY OFFICER}} \hfill {\textit{Oct. 2019 - Sep. 2020}}}
\begin{itemize}
\item Conducted comprehensive security assessments, identifying vulnerabilities and delivering actionable remediation strategies. Activities encompassed vulnerability assessments, penetration testing, as well as web and mobile application security testing.
\item Contributed expertise as consultant conducting cyber maturity assessment in the Middle East. Activities included facilitating workshops with stakeholders, evaluating existing controls, policies, and procedures, and providing recommendations to enhance compliance with the ISO 27001 standard.
\end{itemize}

\vspace{2em}
{\color{DarkGray}{\bfseries{\large Birger.}} \hfill \textit{Phoenix, Mauritius}} \\
{\color{LightGray}{\bfseries{SECURITY OPERATION ANALYST}} \hfill {\textit{Apr. 2017 - Sep. 2019}}}
\begin{itemize}
\item Real-Time security monitoring and analysis of security events through Symantec Managed Security Services (MSS) and IBM QRadar SIEM to swiftly detect potential threats.
\item Promptly addressing security incidents, from initial detection to resolution, ensuring minimal impact and efficient mitigation.
\item Produced comprehensive security reports tailored for diverse stakeholders, providing valuable insights and actionable recommendations.
\item Conducted security assessments for stakeholders in the East African region, employing industry-standard methodologies such as Open Web Application Security Project (OWASP). These assessments encompassed vulnerability assessments and penetration testing aimed at identifying and remediating vulnerabilities, misconfigurations and potential security risks.
\item Ensured compliance with international standards such as ISO 27001 and NIST, aligning security practices with industry best practices and regulatory requirements.
\end{itemize}

\vspace{2em}
\section{EDUCATION}
\label{sec:orgd4a97f0}
{\color{DarkGray}{\bfseries{\large Open University of Mauritius (OUM)}} \hfill \textit{Reduit, Mauritius}} \\
{\color{LightGray}{\bfseries{B.S. IN COMPUTER SCIENCE}} \hfill {\textit{Jul. 2020 - Jul. 2023}}}
\begin{itemize}
\item Coursework: Algorithms, Data Structures \& Complexities, Object-oriented Programming, Computer Architecture, Python, Cybersecurity and Digital Forensics, Blockchain
\item Thesis and Final Year Project: \href{https://github.com/s-takoor/mi-voting}{Blockchain-Based Voting DApp}
\end{itemize}

\vspace{2em}
\section{SKILLS}
\label{sec:org3ff150b}
\begin{itemize}
\item Vulnerability Assessment and Penetration Testing (VA/PT)
\item Incident Handling and Incident Response (IH/IR)
\item Security Auditing and Compliance
\item Security Information and Event Management (SIEM)
\item Threat and Vulnerability Management
\item Cloud Security (AWS)
\item Security Documentation, Metrics, and Reporting
\end{itemize}
\end{document}
